sabre-service/src/main/resources/wsdl/sabreCommand/SabreCommandLLS1.8.1RQ_1.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="https://webservices.sabre.com/websvc" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsd1="http://webservices.sabre.com/sabreXML/2003/07" xmlns:xsd2="http://webservices.sabre.com/sabreXML/2003/07" xmlns:tns="https://webservices.sabre.com/websvc" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
  <types>
    <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import namespace="http://webservices.sabre.com/sabreXML/2003/07" schemaLocation="SabreCommandLLS1.8.1RQRS.xsd"/>
      <xsd:import namespace="http://www.ebxml.org/namespaces/messageHeader" schemaLocation="msg-header-2_0.xsd"/>
      <xsd:import namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" schemaLocation="wsse.xsd"/>
    </xsd:schema>
  </types>
  <message name="SabreCommandLLSInput">
    <part name="header" element="eb:MessageHeader"/>
    <part name="header2" element="wsse:Security"/>
    <part name="body" element="xsd1:SabreCommandLLSRQ"/>
  </message>
  <message name="SabreCommandLLSOutput">
    <part name="header" element="eb:MessageHeader"/>
    <part name="header2" element="wsse:Security"/>
    <part name="body" element="xsd2:SabreCommandLLSRS"/>
  </message>
  <portType name="SabreCommandLLSPortType">
    <operation name="SabreCommandLLSRQ">
      <input message="tns:SabreCommandLLSInput"/>
      <output message="tns:SabreCommandLLSOutput"/>
    </operation>
  </portType>
  <binding name="SabreCommandLLSSoapBinding" type="tns:SabreCommandLLSPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="SabreCommandLLSRQ">
      <soap:operation soapAction="OTA"/>
      <input>
        <soap:header message="tns:SabreCommandLLSInput" part="header" use="literal"/>
        <soap:header message="tns:SabreCommandLLSInput" part="header2" use="literal"/>
        <soap:body parts="body" use="literal"/>
      </input>
      <output>
        <soap:header message="tns:SabreCommandLLSOutput" part="header" use="literal"/>
        <soap:header message="tns:SabreCommandLLSOutput" part="header2" use="literal"/>
        <soap:body parts="body" use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="SabreCommandLLSService">
    <port name="SabreCommandLLSPortType" binding="tns:SabreCommandLLSSoapBinding">
      <soap:address location="https://webservices.sabre.com/websvc"/>
    </port>
  </service>
</definitions>