CodenameNightwing/WebServices/WS especificos/Sabre/XMLSabreRQ/SabreCommandLLSRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns="http://webservices.sabre.com/sabreXML/2003/07">
  <soapenv:Header>
    <sec:Security>
      <sec:BinarySecurityToken valueType="?" EncodingType="?">?</sec:BinarySecurityToken>
    </sec:Security>
    <mes:MessageHeader mes:id="?" mes:version="?">
      <mes:From>
        <!--1 or more repetitions:-->
        <mes:PartyId mes:type="?">?</mes:PartyId>
        <!--Optional:-->
        <mes:Role>?</mes:Role>
      </mes:From>
      <mes:To>
        <!--1 or more repetitions:-->
        <mes:PartyId mes:type="?">?</mes:PartyId>
        <!--Optional:-->
        <mes:Role>?</mes:Role>
      </mes:To>
      <mes:CPAId>AR</mes:CPAId>
      <mes:ConversationId>TestSuitARIT</mes:ConversationId>
      <mes:Service mes:type="?">SabreCommandLLSRQ</mes:Service>
      <mes:Action>SabreCommandLLSRQ</mes:Action>
      <mes:MessageData>
        <mes:MessageId>?</mes:MessageId>
        <mes:Timestamp>?</mes:Timestamp>
        <!--Optional:-->
        <mes:RefToMessageId>?</mes:RefToMessageId>
        <!--Optional:-->
        <mes:TimeToLive>?</mes:TimeToLive>
        <!--Optional:-->
        <mes:Timeout>5</mes:Timeout>
      </mes:MessageData>
      <!--Optional:-->
      <mes:DuplicateElimination>?</mes:DuplicateElimination>
      <!--Zero or more repetitions:-->
      <mes:Description xml:lang="?">?</mes:Description>
      <!--You may enter ANY elements at this point-->
    </mes:MessageHeader>
  </soapenv:Header>
  <soapenv:Body>
    <ns:SabreCommandLLSRQ EchoToken="?" TimeStamp="?" Target="Production" Version="?" SequenceNmbr="?" PrimaryLangID="?" AltLangID="?">
      <ns:Request Output="SCREEN" CDATA="true">
        <ns:HostCommand>?</ns:HostCommand>
      </ns:Request>
    </ns:SabreCommandLLSRQ>
  </soapenv:Body>
</soapenv:Envelope>